content/journal/2024-09-01.org
---
title: Genevieve Has a Nephew Now I Guess
date: 2024-09-01T12:26:43-07:00
draft: false
---

* Margaret and Fennec
- Got into an altercation with Armless Beve?
- And poached some little gremlin guards from his employ?
- They got some cool rare items.
- Including a sentient lockbox that isn't very talkative
- The House has a perception filter, TARDIS-like.
- We enter a port in Absalom
* Mosquito Witch
** Zyzyx (50% chance lies)
- Secretly a green dragon
** Edalyn
- Former cultist
** Me
- Some kind of Fey from the first world?
* Ship
    - Helmsman: Reminiscent of Kiordan's
    - Viper coiled around a rose
    - Colors: Blue and red
*** Hypothesis
- Clone pilots outsourced from some central agency.
*** Truth
- Crest of a Lastwall noble family that dealt in the dark arts
- Name tainted with accusations of treason against Lastwall
- But Bat has heard differently.
- After Lastwall fell, their fate
*** Boatman
- A construct, created using the fragment of a soul. It might not be the creator's soul.
- From there is a husk of a clone.
- If you try to shove him and fail, he phases through
- His grip on the wheel is ironclad
- The clone is ghostly to Petey
* Shimmerford
- The weather sucks
- There's a weird magical mist/haze
- There's a poorly-constructed raft on the water, and Petey is on it.
** Petey
- Beanpole of a kid
- Black hair
- Messy face
- Coat
- Overalls
- So OGTW kid, basically.
- They have a black cat
- Genevieve is a cat person
- The cat's name is Balthazar
*** Balthazar
- I talked to the cat
- It's back just sort of shifted
** Mists
- The mist is mosquitos, clouding over everything
- The mosquito mist is not unheard of, but this intensity is new to Petey
- Zuni: "The iron tower must fall"
- The cloud lightens as we approach Shimmerford
* Shimmerford Shore
- River Kingdoms: Conglemerate of towns and states.
- Shimmerford: ~100 people max
- But there are stories about the Mosquito Festival!
- A celebration of the Mosquito Witch, who is treated as mothman. So beloved cryptid urban myth
- Torches are burning, which have drawn the mosquitos.
- Zuni: The Mosquito Witch might be angry
- Ms Lyons: Old woman in her mid-80s who has supposedly seen the witch. Known to be a kook.
- Zyzyx is growing into a dragon? She's four feet now, and growing tiny wings
** Andy
- Things and people have been going missing
- Including Petey's family
- The Pathfinder Society sent people, who didn't come back.
- Petey's one of us now!
* Exploring
** Inn
- Fennec and Zyzyx
- Found a crazy duded muttering to a mosquito-witch doll, saying "she's talking to me, now that Peter is back maybe she'll leave me alone"
- Some other stuff
** Ms Lyons
- Smoke coming out of the Chimney
- Boarded up windows, as anti-mosquito.
*** Regis
- Regis: Ms. Lyons' nurse (in his early 30s), priest of Tsukiyo (god of doctors/nurses/medicine, patron of declining health and of caretakers)
- A cultist of Glondor moved into the woods
- Around the time Petey disappeared. TODO: Ask Petey for more details on his disappearance
- The cultist maybe died (killed by an angry mob), then weird stuff started happening
- Disease outbreak: Weird black pus
- Started with Petey's brother
- Glondor: Main pantheon god of disease and bugs and rot and decay
- When the cultist moved in: Things disappeared. Lanterns and picks and stuff
- We have a list of symtpoms.
- Stolen: Stone-cutting tools, and lanterns.
**** Lyons
- Witchtop hill, to the north
- Past the bend in the stream
- Some giant monster they thought was a dead animal
- She dreams of the mosquito witch, wakes up with paper dolls by the bed.
** Petey's Story: Zuni
- There was a cat that came by their house and had a bunch of kids
- One was Zuni (the only black cat), about 5 years ago.
- The doll: A man muttering to himself about the iron tower holding the doll
- doll fashioned after the witch, sold at festivals
* Timeline
- Cultist showed up
- Lanterns and tools started vanishing - to build the iron tower
- Petey vanished
- Cultist got angry mobbed
- Petey's family got infected
- The cat is connected to the Mosquito Witch
- The cat wants Petey to be safe.
- The Mosquitos like Petey
- Petey doesn't say much about their adventures
- Petey almost lost Zuni, but rescued them
- Weird story: Petey was prompted to return to Shimmerford by Balthazar.
- The crazy guy said "Peter's back, maybe she'll leave me alone".
- So: The witch is talking to Petey through the cat.
* Into the Woods
- We're seeing footlong mosquitos
- The radius around the burned-down house has no mosquitos
- There is something evil emanating from the ruins of the house
- Edalyn goes to the ruins
- Near the ruins, the ground is disturbed. Mounds of dirt. Something has been dug up and reburied.
- Some kind of claw marks in the dirt. As if a dog dug a hole and buried something.
- Strongest thing: The Edalyn mound. Insanely high level.
- We find a dug-up grave on the other side of the house and tracks leading into the darkness
** Combat
- Rikolakus Spawn
- Bound to burial site
- Bury themselves every morning
- But non-spawn (i.e fully grown) can stay away from burial point for weaks at a time.
- Rikolakus carry diseases, and can infect others.
- So a Rikolakus encounter
- Oh Petey is a witch and Balthazar is her familiar
- Rend: Once a monster has hit you, it can rend, spend an action for a second auto-hit (basically ripping the weapon out)
** After
- We found an idol of Zura underneath the house
- Augury said it would be good to bring it with us
- Genevieve kind of wants to smash it
- So the cultist was a priest of Zura and the Mosquito Witch hates that.
- If we carry the idol with us, the mosquitos may not follow and then Petey will be sad.
