public/journal/2024-09-01/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>Genevieve Has a Nephew Now I Guess | Genevieve&#39;s Journal</title>
<meta name="title" content="Genevieve Has a Nephew Now I Guess" />
<meta name="description" content="Margaret and Fennec Got into an altercation with Armless Beve? And poached some little gremlin guards from his employ? They got some cool rare items. Including a sentient lockbox that isn&#39;t very talkative The House has a perception filter, TARDIS-like. We enter a port in Absalom Mosquito Witch Zyzyx (50% chance lies) Secretly a green dragon Edalyn Former cultist Me Some kind of Fey from the first world? Ship Helmsman: Reminiscent of Kiordan&#39;s Viper coiled around a rose Colors: Blue and red Hypothesis Clone pilots outsourced from some central agency." />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/journal/2024-09-01/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="Genevieve Has a Nephew Now I Guess">
  <meta property="og:description" content="Margaret and Fennec Got into an altercation with Armless Beve? And poached some little gremlin guards from his employ? They got some cool rare items. Including a sentient lockbox that isn&#39;t very talkative The House has a perception filter, TARDIS-like. We enter a port in Absalom Mosquito Witch Zyzyx (50% chance lies) Secretly a green dragon Edalyn Former cultist Me Some kind of Fey from the first world? Ship Helmsman: Reminiscent of Kiordan&#39;s Viper coiled around a rose Colors: Blue and red Hypothesis Clone pilots outsourced from some central agency.">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">
    <meta property="article:section" content="journal">
    <meta property="article:published_time" content="2024-09-01T12:26:43-07:00">
    <meta property="article:modified_time" content="2024-09-01T12:26:43-07:00">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="Genevieve Has a Nephew Now I Guess">
  <meta name="twitter:description" content="Margaret and Fennec Got into an altercation with Armless Beve? And poached some little gremlin guards from his employ? They got some cool rare items. Including a sentient lockbox that isn&#39;t very talkative The House has a perception filter, TARDIS-like. We enter a port in Absalom Mosquito Witch Zyzyx (50% chance lies) Secretly a green dragon Edalyn Former cultist Me Some kind of Fey from the first world? Ship Helmsman: Reminiscent of Kiordan&#39;s Viper coiled around a rose Colors: Blue and red Hypothesis Clone pilots outsourced from some central agency.">


  
  
  <meta itemprop="name" content="Genevieve Has a Nephew Now I Guess">
  <meta itemprop="description" content="Margaret and Fennec Got into an altercation with Armless Beve? And poached some little gremlin guards from his employ? They got some cool rare items. Including a sentient lockbox that isn&#39;t very talkative The House has a perception filter, TARDIS-like. We enter a port in Absalom Mosquito Witch Zyzyx (50% chance lies) Secretly a green dragon Edalyn Former cultist Me Some kind of Fey from the first world? Ship Helmsman: Reminiscent of Kiordan&#39;s Viper coiled around a rose Colors: Blue and red Hypothesis Clone pilots outsourced from some central agency.">
  <meta itemprop="datePublished" content="2024-09-01T12:26:43-07:00">
  <meta itemprop="dateModified" content="2024-09-01T12:26:43-07:00">
  <meta itemprop="wordCount" content="923">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/threads">Quest Threads</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>Genevieve Has a Nephew Now I Guess</h1>
<p class="byline">
  <time datetime='2024-09-01' pubdate>
    2024-09-01
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Margaret and Fennec
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>Got into an altercation with Armless Beve?</li>
<li>And poached some little gremlin guards from his employ?</li>
<li>They got some cool rare items.</li>
<li>Including a sentient lockbox that isn&#39;t very talkative</li>
<li>The House has a perception filter, TARDIS-like.</li>
<li>We enter a port in Absalom</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Mosquito Witch
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Zyzyx (50% chance lies)
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li>Secretly a green dragon</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Edalyn
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>Former cultist</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Me
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li>Some kind of Fey from the first world?</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Ship
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<ul>
<li>Helmsman: Reminiscent of Kiordan&#39;s</li>
<li>Viper coiled around a rose</li>
<li>Colors: Blue and red</li>
</ul>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
Hypothesis
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<ul>
<li>Clone pilots outsourced from some central agency.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
Truth
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<ul>
<li>Crest of a Lastwall noble family that dealt in the dark arts</li>
<li>Name tainted with accusations of treason against Lastwall</li>
<li>But Bat has heard differently.</li>
<li>After Lastwall fell, their fate</li>
</ul>
</div>
</div>
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
Boatman
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<ul>
<li>A construct, created using the fragment of a soul. It might not be the creator&#39;s soul.</li>
<li>From there is a husk of a clone.</li>
<li>If you try to shove him and fail, he phases through</li>
<li>His grip on the wheel is ironclad</li>
<li>The clone is ghostly to Petey</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
Shimmerford
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<ul>
<li>The weather sucks</li>
<li>There&#39;s a weird magical mist/haze</li>
<li>There&#39;s a poorly-constructed raft on the water, and Petey is on it.</li>
</ul>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Petey
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<ul>
<li>Beanpole of a kid</li>
<li>Black hair</li>
<li>Messy face</li>
<li>Coat</li>
<li>Overalls</li>
<li>So OGTW kid, basically.</li>
<li>They have a black cat</li>
<li>Genevieve is a cat person</li>
<li>The cat&#39;s name is Balthazar</li>
</ul>
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
Balthazar
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<ul>
<li>I talked to the cat</li>
<li>It&#39;s back just sort of shifted</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Mists
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<ul>
<li>The mist is mosquitos, clouding over everything</li>
<li>The mosquito mist is not unheard of, but this intensity is new to Petey</li>
<li>Zuni: &#34;The iron tower must fall&#34;</li>
<li>The cloud lightens as we approach Shimmerford</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
Shimmerford Shore
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<ul>
<li>River Kingdoms: Conglemerate of towns and states.</li>
<li>Shimmerford: ~100 people max</li>
<li>But there are stories about the Mosquito Festival!</li>
<li>A celebration of the Mosquito Witch, who is treated as mothman. So beloved cryptid urban myth</li>
<li>Torches are burning, which have drawn the mosquitos.</li>
<li>Zuni: The Mosquito Witch might be angry</li>
<li>Ms Lyons: Old woman in her mid-80s who has supposedly seen the witch. Known to be a kook.</li>
<li>Zyzyx is growing into a dragon? She&#39;s four feet now, and growing tiny wings</li>
</ul>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Andy
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<ul>
<li>Things and people have been going missing</li>
<li>Including Petey&#39;s family</li>
<li>The Pathfinder Society sent people, who didn&#39;t come back.</li>
<li>Petey&#39;s one of us now!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-2">
<h2 id="headline-16">
Exploring
</h2>
<div id="outline-text-headline-16" class="outline-text-2">
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
Inn
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<ul>
<li>Fennec and Zyzyx</li>
<li>Found a crazy duded muttering to a mosquito-witch doll, saying &#34;she&#39;s talking to me, now that Peter is back maybe she&#39;ll leave me alone&#34;</li>
<li>Some other stuff</li>
</ul>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
Ms Lyons
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<ul>
<li>Smoke coming out of the Chimney</li>
<li>Boarded up windows, as anti-mosquito.</li>
</ul>
<div id="outline-container-headline-19" class="outline-4">
<h4 id="headline-19">
Regis
</h4>
<div id="outline-text-headline-19" class="outline-text-4">
<ul>
<li>Regis: Ms. Lyons&#39; nurse (in his early 30s), priest of Tsukiyo (god of doctors/nurses/medicine, patron of declining health and of caretakers)</li>
<li>A cultist of Glondor moved into the woods</li>
<li>Around the time Petey disappeared. TODO: Ask Petey for more details on his disappearance</li>
<li>The cultist maybe died (killed by an angry mob), then weird stuff started happening</li>
<li>Disease outbreak: Weird black pus</li>
<li>Started with Petey&#39;s brother</li>
<li>Glondor: Main pantheon god of disease and bugs and rot and decay</li>
<li>When the cultist moved in: Things disappeared. Lanterns and picks and stuff</li>
<li>We have a list of symtpoms.</li>
<li>Stolen: Stone-cutting tools, and lanterns.</li>
</ul>
<div id="outline-container-headline-20" class="outline-5">
<h5 id="headline-20">
Lyons
</h5>
<div id="outline-text-headline-20" class="outline-text-5">
<ul>
<li>Witchtop hill, to the north</li>
<li>Past the bend in the stream</li>
<li>Some giant monster they thought was a dead animal</li>
<li>She dreams of the mosquito witch, wakes up with paper dolls by the bed.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
Petey&#39;s Story: Zuni
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<ul>
<li>There was a cat that came by their house and had a bunch of kids</li>
<li>One was Zuni (the only black cat), about 5 years ago.</li>
<li>The doll: A man muttering to himself about the iron tower holding the doll</li>
<li>doll fashioned after the witch, sold at festivals</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-22" class="outline-2">
<h2 id="headline-22">
Timeline
</h2>
<div id="outline-text-headline-22" class="outline-text-2">
<ul>
<li>Cultist showed up</li>
<li>Lanterns and tools started vanishing - to build the iron tower</li>
<li>Petey vanished</li>
<li>Cultist got angry mobbed</li>
<li>Petey&#39;s family got infected</li>
<li>The cat is connected to the Mosquito Witch</li>
<li>The cat wants Petey to be safe.</li>
<li>The Mosquitos like Petey</li>
<li>Petey doesn&#39;t say much about their adventures</li>
<li>Petey almost lost Zuni, but rescued them</li>
<li>Weird story: Petey was prompted to return to Shimmerford by Balthazar.</li>
<li>The crazy guy said &#34;Peter&#39;s back, maybe she&#39;ll leave me alone&#34;.</li>
<li>So: The witch is talking to Petey through the cat.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-23" class="outline-2">
<h2 id="headline-23">
Into the Woods
</h2>
<div id="outline-text-headline-23" class="outline-text-2">
<ul>
<li>We&#39;re seeing footlong mosquitos</li>
<li>The radius around the burned-down house has no mosquitos</li>
<li>There is something evil emanating from the ruins of the house</li>
<li>Edalyn goes to the ruins</li>
<li>Near the ruins, the ground is disturbed. Mounds of dirt. Something has been dug up and reburied.</li>
<li>Some kind of claw marks in the dirt. As if a dog dug a hole and buried something.</li>
<li>Strongest thing: The Edalyn mound. Insanely high level.</li>
<li>We find a dug-up grave on the other side of the house and tracks leading into the darkness</li>
</ul>
<div id="outline-container-headline-24" class="outline-3">
<h3 id="headline-24">
Combat
</h3>
<div id="outline-text-headline-24" class="outline-text-3">
<ul>
<li>Rikolakus Spawn</li>
<li>Bound to burial site</li>
<li>Bury themselves every morning</li>
<li>But non-spawn (i.e fully grown) can stay away from burial point for weaks at a time.</li>
<li>Rikolakus carry diseases, and can infect others.</li>
<li>So a Rikolakus encounter</li>
<li>Oh Petey is a witch and Balthazar is her familiar</li>
<li>Rend: Once a monster has hit you, it can rend, spend an action for a second auto-hit (basically ripping the weapon out)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-25" class="outline-3">
<h3 id="headline-25">
After
</h3>
<div id="outline-text-headline-25" class="outline-text-3">
<ul>
<li>We found an idol of Zura underneath the house</li>
<li>Augury said it would be good to bring it with us</li>
<li>Genevieve kind of wants to smash it</li>
<li>So the cultist was a priest of Zura and the Mosquito Witch hates that.</li>
<li>If we carry the idol with us, the mosquitos may not follow and then Petey will be sad.</li>
</ul>
</div>
</div>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
